# GetSelectionUIOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SelectionUIOptions..::..GetSelectionUIOptions Method
SelectionUIOptions Class See Also
---
Returns the current user's SelectionOptions.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public static SelectionUIOptions GetSelectionUIOptions()
```

Visual Basic
---
```text
Public Shared Function GetSelectionUIOptions As SelectionUIOptions
```

Visual C++
---
```text
public:
static SelectionUIOptions^ GetSelectionUIOptions()
```

# ### Return Value
The SelectionOptions for the current user.
# See Also
SelectionUIOptions Class
Autodesk.Revit.UI Namespace